CDMDEV.RSN_/src/Catalogs/ДополнительныеКонстанты/ДополнительныеКонстанты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДополнительныеКонстанты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Значения</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеХранилище</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеВХранилищеЗначений</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

CDMDEV.RSN_/src/CommonModules/ОбщегоНазначенияВызовСервера/Module.bsl
Функция ЗначениеДополнительнойКонстанты(ИмяКонстанты, ВозвращатьКакМассив = Ложь, ВызыватьИсключение = Истина) Экспорт
	
	ЗначениеДополнительнойКонстанты = Новый Массив;
	
	СправочникСсылка = Справочники.ДополнительныеКонстанты.НайтиПоНаименованию(ИмяКонстанты, Истина);
	
	Если НЕ СправочникСсылка.Пустая() Тогда
		
		ЗначениеДополнительнойКонстанты = Новый Массив;
		
		Для Каждого СтрокаЗначений Из СправочникСсылка.Значения Цикл
			
			Если НЕ СтрокаЗначений.ЗначениеВХранилищеЗначений Тогда
				
				ЗначениеДополнительнойКонстанты.Добавить(СтрокаЗначений.Значение);
				
			Иначе
				
				ЗначениеДополнительнойКонстанты.Добавить(СтрокаЗначений.ЗначениеХранилище.Получить());
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеДополнительнойКонстанты.Количество() = 1 И НЕ ВозвращатьКакМассив Тогда
			
			ЗначениеДополнительнойКонстанты = ЗначениеДополнительнойКонстанты[0];
			
		КонецЕсли;
		
	ИначеЕсли ВызыватьИсключение Тогда
		
		ВызватьИсключение "Не найдена доп. константа: """ + ИмяКонстанты + """";
		
	КонецЕсли;
	
	Возврат ЗначениеДополнительнойКонстанты;
	
КонецФункции
